SigninLogs
| where ResourceDisplayName == "Device Registration Service"
| where AppDisplayName == "Microsoft Device Registration Client"
| order by TimeGenerated
| project
    TimeGenerated,
    UserDisplayName,
    AppDisplayName,
    AppId,
   ResourceDisplayName,
    IPAddress,
    LocationDetails,
    UserAgent,
    Status,
    DeviceDetail
